In [2]:
import pandas as pd
import numpy as np

In [3]:
sr=pd.Series([10,9,8,7,6])

In [4]:
sr

0    10
1     9
2     8
3     7
4     6
dtype: int64

In [5]:
sr.values

array([10,  9,  8,  7,  6])

In [6]:
sr.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
sr.shape

(5,)

In [8]:
sr[3]

7

In [9]:
sr[[0,2,4]]

0    10
2     8
4     6
dtype: int64

In [10]:
sr=pd.Series([10,9,8,7,6],index=['a','b','c','d','e'])

In [11]:
sr

a    10
b     9
c     8
d     7
e     6
dtype: int64

In [12]:
sr['c']

8

In [13]:
sr[['c','d']]

c    8
d    7
dtype: int64

In [14]:
sr['b':'d']

b    9
c    8
d    7
dtype: int64

In [15]:
dict_data={'COL':100,'MX':200,'AR':300}

In [16]:
dict_data.keys()

dict_keys(['COL', 'MX', 'AR'])

In [17]:
dict_data['AR']

300

In [18]:
pd.Series(dict_data)

COL    100
MX     200
AR     300
dtype: int64

In [19]:
sr=pd.Series(dict_data,index=['COL','MX','PE'])

In [20]:
np.nan +10

nan

In [21]:
sr.isnull()

COL    False
MX     False
PE      True
dtype: bool

In [22]:
sr.notnull()

COL     True
MX      True
PE     False
dtype: bool

In [23]:
dict_data={'CH':[100,800,200],'CO':[100,200,300],'MX':[300,500,400]}

In [24]:
dict_data

{'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}

In [25]:
df=pd.DataFrame(dict_data)

In [26]:
df

    CH   CO   MX
0  100  100  300
1  800  200  500
2  200  300  400

In [27]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}

In [28]:
dict_data

{'edad': [10, 9, 13, 14, 12, 11, 12],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9]}

In [29]:
df=pd.DataFrame(dict_data, index={'ana','benito','camilo','daniel','erika','fabian','gabriela'})

In [30]:
df

          edad   cm pais genero    Q1  Q2
fabian      10  115   co      M   5.0   7
ana          9  110   mx      F  10.0   9
erika       13  130   co      F   8.0   9
gabriela    14  155   mx      M   NaN   8
daniel      12  125   mx      M   7.0   8
benito      11  120   ch      M   8.0   8
camilo      12  125   ch      F   3.0   9

In [31]:
df.index

Index(['fabian', 'ana', 'erika', 'gabriela', 'daniel', 'benito', 'camilo'], dtype='object')

In [32]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [33]:
df.values

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

In [34]:
df['edad']

fabian      10
ana          9
erika       13
gabriela    14
daniel      12
benito      11
camilo      12
Name: edad, dtype: int64

In [35]:
df[['edad','cm','Q1']]

          edad   cm    Q1
fabian      10  115   5.0
ana          9  110  10.0
erika       13  130   8.0
gabriela    14  155   NaN
daniel      12  125   7.0
benito      11  120   8.0
camilo      12  125   3.0

In [36]:
df.loc['ana',['edad','cm','Q1']]

edad       9
cm       110
Q1      10.0
Name: ana, dtype: object

In [38]:
df.loc[['ana','erika'],['edad','cm','Q1']]

       edad   cm    Q1
ana       9  110  10.0
erika    13  130   8.0

In [39]:
df.loc['daniel','Q1']

7.0

In [40]:
df.iloc[2,1]

130

In [46]:
df.iloc[[2,4,5],[1,3]]

         cm genero
erika   130      F
daniel  125      M
benito  120      M

In [47]:
df.iloc[:,[1,3]]

           cm genero
fabian    115      M
ana       110      F
erika     130      F
gabriela  155      M
daniel    125      M
benito    120      M
camilo    125      F

In [48]:
df['edad']>=12

fabian      False
ana         False
erika        True
gabriela     True
daniel       True
benito      False
camilo       True
Name: edad, dtype: bool

In [49]:
df[df['edad']>=12]

          edad   cm pais genero   Q1  Q2
erika       13  130   co      F  8.0   9
gabriela    14  155   mx      M  NaN   8
daniel      12  125   mx      M  7.0   8
camilo      12  125   ch      F  3.0   9

In [50]:
df[(df['edad']>=12) & (df['pais']=='mx')]

          edad   cm pais genero   Q1  Q2
gabriela    14  155   mx      M  NaN   8
daniel      12  125   mx      M  7.0   8

In [51]:
df.query('edad>=12')

          edad   cm pais genero   Q1  Q2
erika       13  130   co      F  8.0   9
gabriela    14  155   mx      M  NaN   8
daniel      12  125   mx      M  7.0   8
camilo      12  125   ch      F  3.0   9

In [52]:
df.query('edad>=12 and pais=="mx"')

          edad   cm pais genero   Q1  Q2
gabriela    14  155   mx      M  NaN   8
daniel      12  125   mx      M  7.0   8

In [54]:
df[df['Q2']>=df['Q1']]

        edad   cm pais genero   Q1  Q2
fabian    10  115   co      M  5.0   7
erika     13  130   co      F  8.0   9
daniel    12  125   mx      M  7.0   8
benito    11  120   ch      M  8.0   8
camilo    12  125   ch      F  3.0   9

In [55]:
df.query('Q2>=Q1')

        edad   cm pais genero   Q1  Q2
fabian    10  115   co      M  5.0   7
erika     13  130   co      F  8.0   9
daniel    12  125   mx      M  7.0   8
benito    11  120   ch      M  8.0   8
camilo    12  125   ch      F  3.0   9